Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: You cannot tame a wolf.
jbo: noda kakne lo nu tolcicygau lo labno

source: Hey you, shut up!
jbo: .ionai ko tavla sisti

source: Hey, you! What are you doing?
jbo: coi do i do ca jai gau mo

source: Who's Emily?
jbo: la .emilin. mo

source: Oh my God, I cant believe this.
jbo: .ue .i .e'enai mi na krici ti

source: Let me see.
jbo: ko curmi lo nu mi viska

source: Yeah. I think so, too.
jbo: .ie .i pe'i ji'a go'i

source: A dolphin is a mammal.
jbo: lo delfinu cu mabru

source: No, sit down.
jbo: i'e nai .i ko zutse

source: I am coming.
jbo: klama

source: When were you born?
jbo: ca ma do jbena

source: When are you off?
jbo: ca ma do cliva

source: When did you buy the watch?
jbo: ca ma do pu te vecnu le junla

source: Tell me when to stop.
jbo: ko cusku fi mi fe lo se du'u ca makau mi sisti

source: You don't have to tell the truth all the time.
jbo: .e'i nai ro roi jetsku

source: Always have your dictionary near at hand.
jbo: .e'u ko roroi jbira'e lo do vlacku

source: I met the usual people at the usual place.
jbo: mi penmi zu'i zu'i

source: I don't remember when and where I met you.
jbo: mi na morji lo du'u vi je ca makau mi penmi do

source: When do you leave here?
jbo: ca ma do cliva ti

source: The English are a practical people.
jbo: loi glipre cu tcikaizu'e

source: Don't give me that!
jbo: ko na dunda ta mi

source: No, he didn't.
jbo: na go'i .i ra na co'e

source: Ann is a little girl.
jbo: la .an. cmalu nixli

source: Ann has no sister.
jbo: noda la .an. mensi

source: What's that?
jbo: ta mo

source: Those photos are hers.
jbo: ti za'u kacma pixra co me ta

source: Those flowers smell sweet.
jbo: za'u va xrula ku se panci lo titla

source: Those houses are big.
jbo: za'u va dinju ku barda

source: Those apples are big.
jbo: za'u va plise ku barda

source: That is his house.
jbo: ta du lo ko'a zdani

source: That is his car.
jbo: ta karce gi'e selpo'e ra

source: That is the house where he lives.
jbo: ta zdani ra

source: Is that a cat or a dog?
jbo: ta mlatu je'i gerku

source: Whose car is that?
jbo: ma ralte lo va karce

source: I call that some poem.
jbo: ti mutce xamgu pemci

source: "Five!" says Alex.
jbo: zo mu se cusku la.aleks.

source: That is mine.
jbo: ta me mi moi

source: One day she met a wolf in the woods.
jbo: pa roi ra penmi lo labno ne'i lo ricfoi

source: One day she and I visited an old friend.
jbo: ca lo zdadei ra joi mi vitke lo slabu pendo

source: It was said that a great poet had resided here.
jbo: ti'e lo banli pemfi'i pu vi xabju

source: Alfred was made captain of the team.
jbo: la .alfred. jatna binxo

source: The Alps are in the center of Europe.
jbo: la .alps. midju le rontu'a

source: Alice might have been there yesterday, but we didn't see her.
jbo: .i ie la. alis. zvati da'i ca lo prulamdei .ijeku'i mi'a na viska .abu

source: Arabic is a very important language.
jbo: lo xrabo cu mutce vajni bangu

source: Americans are very friendly people.
jbo: le'e merko ku pendo tarti

source: The United States borders Canada.
jbo: lo gugde'usu cu korbi lo gugdecu'a

source: Africa is a continent; Greenland is not.
jbo: lo friko cu braplu .i je lo gugdegulu na co'e

source: That room is not very large.
jbo: lo va kumfa na barda mutce

source: Look at that cat. It is Mr Brown's.
jbo: ko catlu lo mlatu .i ra selponse la .braun.

source: That is the woman who wants to see you.
jbo: ta du lo ninmu poi djica lo nu viska do

source: Who's that girl?
jbo: lo va nixli cu mo

source: That girl looks very pretty.
jbo: lo ta ninmu cu tcemelbi

source: He is a slim child.
jbo: ra cinla verba

source: That dog has a short tail.
jbo: lo va gerku cu se rebla lo tordu

source: Look at that brilliant star.
jbo: ko catlu lo carmi tarci

source: What do you imagine when you see that picture?
jbo: ma xanri do ca lo nu do zgana lo va pixra

source: Look at that picture.
jbo: ko catlu lo va pixra

source: That flower smells sweet.
jbo: ti poi xrula cu xamgu se sumne

source: That house belongs to him.
jbo: lo va zdani cu selpo'e ra

source: That house is big.
jbo: lo va zdani cu barda

source: That house is very small.
jbo: lo va zdani cu mutce cmalu

source: That house belongs to me.
jbo: lo va zdani cu selpo'e mi

source: Whose notebook is that?
jbo: ma se srana lo va ci'arselpapri

source: Look at that pretty little girl.
jbo: ko catlu ta poi melbi je cmalu nixli

source: That toy is made of wood.
jbo: lo va selkei cu mudri

source: That dog is big.
jbo: lo vi gerku ku barda

source: Are you free tomorrow?
jbo: xu do zifre ca lo bavlamdei

source: You have a lot of books.
jbo: do ralte so'i lo cukta

source: You are from Hokkaido, aren't you?
jbo: do jbena fo la.xokaidon. vau je'u pei

source: You were busy.
jbo: do pu tolcando

source: Are you busy?
jbo: xu do tolcando

source: Are you studying?
jbo: xu do tadni

source: You may rely on him.
jbo: e'a do lacri ra

source: You are not Japanese.
jbo: do na ponjo

source: Do you speak Japanese?
jbo: xu do se bangu lo ponjo

source: Do you have two books?
jbo: xu do ralte re lo cukta

source: Who are you talking with?
jbo: do tavla ma

source: You are very beautiful.
jbo: do mutce melbi

source: Can you run fast?
jbo: xu do ka'e sutra bajra

source: You are a teacher.
jbo: do ctuca

source: You guessed right.
jbo: do smadi lo jetnu

source: Do you have a car?
jbo: xu do ralte da poi karce

source: Do you live in Sasayama?
jbo: xu do xabju la.sasa,iaman.

source: I'm afraid you misunderstood me.
jbo: pe'i do pu jmisre fi lo selsku be mi

source: You have more energy than I.
jbo: do mi zmadu lo ni toltatpi

source: Have you finished your work?
jbo: xu lo nu do gunka cu mulno

source: You were at home yesterday, weren't you?
jbo: do zvati le zdani ca lo prulamdei vau je'upei

source: Will you stay at home tonight?
jbo: xu do stali lo zdani ze'a lo cabycte

source: He said that you ought to go.
jbo: ko'a pu cusku lo nu do ei klama

source: You are stupid.
jbo: do bebna

source: Are you a student?
jbo: xu do tadni

source: You are a very good artist.
jbo: do tcexau larfi'i

source: How many siblings do you have?
jbo: xo da tunba do

source: Do you believe in any religion?
jbo: xu da lijda do

source: Are you studying English?
jbo: xu do ca tadni le glibau

source: Can you translate English into Japanese?
jbo: xu do ka'e fanva fo lo glibau fi lo ponbau

source: Do you like English?
jbo: xu do nelci lo glibau

source: He as well as you is tired of this work.
jbo: ra dunli do lo ka tatpi lo bi'unai se gunka

source: You're still young.
jbo: do za'o citno

source: What did you say to Paula?
jbo: do cusku ma la .paulas.

source: What train you are going to take?
jbo: do djica co klama fu lo mo trene

source: You are so kind.
jbo: do mutce xendo

source: You can watch television.
jbo: do ka'e zgana lo veltivni

source: You should have kept it secret.
jbo: do bilga lonu do mipri ti

source: Are you going there on business?
jbo: xu le nu do klama cu srana lo selgu'a

source: Do you play soccer?
jbo: xu do boltipyjvi

source: You look just like your mother.
jbo: do mintu lo mamta be do

source: Are you going to go to Tokyo tomorrow?
jbo: xu do klama la tokios. ca lo bavlamdei

source: Do you believe in UFOs?
jbo: xu do krici tu'a lo fangyvinji

source: You have never been to Okinawa, have you?
jbo: do no roi zvati la.okinauan. vau je'u pei

source: How do you pronounce your name?
jbo: ta'i ma bacru lo cmene be do

source: Write your name and address.
jbo: ko ciska lo do cmene je lo judri

source: Here is your book.
jbo: lo do cukta ti zvati

source: I hope for your success.
jbo: mi pacna lo nu do snada

source: What is your name?
jbo: ma cmene do

source: I guess you're right, Jane.
jbo: pe'i do drani doi jein

source: Were your mother and father home?
jbo: xu lo do patfu joi mamta pu zvati lo zdani

source: Your father is tall.
jbo: lo patfu be do cu rajycla

source: I gave you a book.
jbo: mi pu dunda fi do fe lo cukta

source: I have something to talk over with you.
jbo: .ai da se casnu mi'o

source: I cannot agree with you.
jbo: ie nai ei

source: You and he are both very kind.
jbo: do e ra xendo mutce

source: I know that you are busy.
jbo: mi djuno lo du'u do tolcando

source: You came out of the room.
jbo: do pu barkla le kumfa

source: What was the music you were listening to?
jbo: do pu tirna ma poi zgike

source: Who will look after your cat while you are away?
jbo: ma lo do mlatu cu kurji ca'o do darno

source: It is surprising that you should know her name.
jbo: .ue do djuno lo cmene be ko'a

source: I want to see you before you go.
jbo: mi djica lonu viska do pu lonu do cliva

source: I do love you.
jbo: mi je'a prami do

source: We are glad you are coming.
jbo: .ui do klama

source: What happened to you last night?
jbo: mo do ca lo prulamcte

source: Please explain it to me later.
jbo: e'o do ciksi fi mi ba po'o

source: All is quiet.
jbo: roda smaji

source: There came a complete silence. You could hear a pin drop.
jbo: mulno smaji .i tirna lo nu lo pijne cu farlu

source: There is nobody about.
jbo: no lo prenu cu zvati

source: I'll kill him.
jbo: mi ba catra ko'a

source: Two ice creams, please.
jbo: e'o remei bisyladru

source: Well, I just remembered.
jbo: sa'u mi zi morji

source: I'm dying for a beer!
jbo: mi mutce taske lo birje

source: What does "PTA" stand for?
jbo: ma smuni zo'oi PTA

source: What is the precise meaning of "precise"?
jbo: ma satci smuni zo'oi precise

source: As it was past 8 p.m. we called it a day.
jbo: .i ki'u lo du'u se tcika li za'ubi kei mi'a sisti

source: He must be over fifty.
jbo: ju'o tu'a ra nanca li su'o mu no

source: Four boys amused themselves playing cards.
jbo: vo nanla pu se zdile lonu ri kelci lo kelkarda

source: April is the fourth month of the year.
jbo: lo prilio cu vomoi masti lo'e nanca

source: Both are alive.
jbo: re xai jmive

source: No less than twenty houses were burnt down.
jbo: pu jelca daspo su'o reno zdani

source: I must buy one.
jbo: ei mi terve'u pa ti

source: A yard is equal to three feet.
jbo: lo cibjmagutci cu du lo jmagutci be li ci

source: A dollar is equal to a hundred cents.
jbo: lo pa meryru'u cu dunli lo panono merfei

source: It's the third of October.
jbo: li ci pi'e pi'e dau ca detri

source: "Is she young?" "Yes, she is."
jbo: lu .i xu ra citno li'u lu .i go'i .i ra citno li'u

source: "How old is she?" "She is twelve years old."
jbo: lu tu'a ra nanca li xo li'u lu pare li'u

source: "Who is in the car?" "Tom is."
jbo: lu ma nenri lo karce li'u .i lu la .tam. li'u

source: "A Happy New Year!" "I wish you the same!"
jbo: gleki ke cnino nanca di'ai .i go'i di'ai do

source: "Don't cry," she said.
jbo: ko na klaku sei ra cusku

source: What is the English for "kaisha"?
jbo: ma xe fanva zoi zoi. kaisha zoi. lo glibau

source: "Who is that girl?" "That's Keiko."
jbo: lu ma du lo va nixli li'u lu la .keikos. li'u

source: "Where do you live?" "I live in Tokyo."
jbo: lu do xabju ma li'u .i lu mi xabju la.tokion. li'u

source: "You are Israel's teacher," said Jesus.
jbo: lu do me lo ctuca pe lo brogu'e li'u se cusku la.iesus.

source: I have not only that to do.
jbo: mi e'i zukte da po'onai

source: Hello, how are you?
jbo: coi .i pei

source: Welcome!
jbo: fi'i

source: I'm going to bed!
jbo: .a'e nai mi ckakla

source: In other words, you should doubt common sense.
jbo: va'i bilga lo nu senpi lo kaurselju'o

source: I have no interest in ordinary people.
jbo: tu'a lo fadni remna cu to'e cinri mi

source: This book is yours.
jbo: do ponse lo vi cukta

source: Will you go by train?
jbo: xu do klama fu lo trene

source: I'll love you forever.
jbo: mi ba roroi prami do

source: My brother likes music.
jbo: lo bruna be mi ku nelci lo zgike

source: My brother is not satisfied with his new car.
jbo: .i lo bruna be mi na se mansa lo selpo'e be puzico'aku karce

source: For the economy as a whole, recovery seems still far away.
jbo: fi piro le selpraci'e fa lo ka refyba'o cu simlu lo ka darno

source: I have to go to the police station.
jbo: .ei mi klama lo pulji tcana

source: The police wanted to avoid bloodshed.
jbo: loi pulji cu djica lo nu na xrani

source: Policemen work at the risk of their own lives.
jbo: lo pulji cu gunka fi'o se tolnu'a lo nu mrobi'o

source: I met Yoko on my way to the theater.
jbo: mi penmi la.iokon. ca lo nu klama lo dracydi'u

source: Never break your promise.
jbo: ko na jai daspo lo selnu'e ca da

source: The result is still in doubt.
jbo: lo jalge ca'o se senpi

source: The moon is distant from the earth.
jbo: lo lunra cu darno lo terdi

source: Ken went to the park to meet Yumi.
jbo: la.ken. cu klama lo panka te zu'e lo nu penmi la.iumin.

source: Who runs faster, Ken or Tony?
jbo: ma traji lo ka sutra bajra kei fo lu'i la .ken. .e la .tonis.

source: You must take good care of yourself.
jbo: do do kurji .eipei

source: Fresh air is necessary to good health.
jbo: nitcu loi vifne djacu lo nu kanro

source: Take care of your health.
jbo: ko kanro

source: Not being careful of his health, he fell ill.
jbo: ki'u lo nu kamka'o toljunri ku tolkanro binxo

source: Your health is more important.
jbo: lo do kamka'o cu vaizma

source: Health is above wealth.
jbo: lo ka kanro cu vaizma lo ka ricfu

source: Nothing is better than health.
jbo: no da zmadu lo za'i kanro lo ka xamgu

source: Kentaro is staying with his friend in Kyoto.
jbo: la.kentaron. cu stali la.kioton. fi'o kansa lo pendo be vo'a

source: I tried to stop their quarrel, but that was not easy.
jbo: mi troci lo du'u ko'a co'u simda'a noi ku'i na'e frili

source: The dog bit me in the hand.
jbo: lo gerku pu batci mi lo xance

source: Don't throw a stone at the dog.
jbo: ko na renro lo rokci lo gerku

source: Without the key, she could not have entered the room.
jbo: se cau lo ckiku ko'a na nerkla lo kumfa

source: May I have the key?
jbo: e'apei mi pilno le ckiku

source: You're looking good!
jbo: do melbi se catlu

source: Good luck.
jbo: di'ai

source: It's an old piano.
jbo: slabu pipno

source: Live and let live.
jbo: ko jmive gije curmi lo nu jmive

source: To know oneself is not easy.
jbo: lo su'u djuno tu'a lo sevzi na frili

source: Lock the door without fail.
jbo: ko snada lo nu lo vorme cu ganlo

source: The door remains closed.
jbo: le vorme cu ca'o ganlo

source: Potential customers have been listed.
jbo: lo cumterve'u cu pu terzba lo liste

source: It is going to rain this afternoon.
jbo: carvi ca lo zi lecydo'i

source: I hope you will be completely cured.
jbo: .i .a'o do di'a mulno kanro

source: Are there many trees in the park?
jbo: xu lo panka cu stuzi so'i tricu

source: Open your mouth and close your eyes.
jbo: ko kargau lo moklu gi'e ga'orgau lo kanla

source: You talk too much.
jbo: do dukse tavla

source: Do you see any policeman over there?
jbo: xu do viska da poi vu pulji

source: You may choose what you like.
jbo: do ka'e cuxna lo se nelci

source: Who's your favorite actor?
jbo: ma se rairnei be do xe draci

source: You have to do it, whether you like it or not.
jbo: do bilga gi'u djica

source: Curiosity killed the cat.
jbo: lo ka kucli cu catra lo mlatu

source: Happily, the workaholic did not die.
jbo: .ui le gunka ckaji na pu mrobi'o

source: As he entered the hall, two men approached him.
jbo: ca ko'a nerkla lo nerklaji ku re nanmu jbibi'o ko'a

source: Think about it.
jbo: ko pensi

source: Let's go!
jbo: mi'ai e'u klama

source: The lecturer spoke on pollution problems.
jbo: ctununta'a fo lo toljinsa nabmi

source: Thanks to the heavy rain, vegetable prices rose sharply.
jbo: ni'i lenu denmi carvi kei lo stagi cu zenba lo jdima

source: A woman is going into it now.
jbo: lo ninmu ca nerkla

source: I am learning to play the guitar now.
jbo: caku mi ca'o crebi'o lo nu jgita zgizu'e

source: I'm very happy now.
jbo: mi mutce gleki

source: It is going to snow.
jbo: lo snime ba carvi

source: Do it when you have time.
jbo: ko co'e ca lo nu cando

source: I've never seen a real cow.
jbo: mi noroi viska lo bakni

source: What is popular now?
jbo: ma ca selzaumi'o

source: You must bear in mind what I've just said to you.
jbo: ei dai ko pensi lo zi se cusku be mi bei do

source: Don't come to me now with that. You should have said something when it originally happened.
jbo: .i ko mi tavla zo'e naku caku .i .eidai do co'e ca lo nu me'au lo te go'i

source: What have you been doing this week?
jbo: do ma zukte ca lo pu zi jeftu

source: Who's the D. J. today?
jbo: ma zgicu'a ca lo cabdei

source: I do not think it will rain this afternoon.
jbo: mi na jinvi lodu'u carvi ca le zi lecydo'i

source: Today I have a lot of things to do.
jbo: ca lo cabdei mi mutce selcu'u

source: I would like to do something else today.
jbo: au mi zukte lo drata ca lo cabdei

source: It's hot today.
jbo: glare ca lo cabdei

source: It's rather cold today.
jbo: rau xoi lenku ca lo cabdei

source: It is cloudy today.
jbo: lo dilnu cu tcima ca lo cabdei

source: It's really cold today.
jbo: tcelenku ca lo cabdei

source: I hear Latin music is taking the music industry by storm this year.
jbo: ti'e lo xispo zgike cu suksa jinga lo zgike gundi ca lo cabna'a

source: If he dies now, the situation will become serious.
jbo: va'o lo nu ra zi mrobi'o kei lo tcini co'a ckape

source: Come and see me tonight.
jbo: ko klama gije viska mi de'i li no ca lo nicte

source: Why don't you sit down and relax?
jbo: pe'u ko zutse gi'e surla

source: My vision is getting worse these days.
jbo: .i lo mi viska nilxau zo'u caze'aca jdika

source: The last wound proved fatal.
jbo: lo xrani romoi cu se jalge lo nu morsi

source: His wife being out, he cooked dinner for himself.
jbo: mu'i lo za'i lo ko'a selspe cu darno kei ko'a selfu be ri jukpa lo vacysai

source: A man whose wife is dead is called a widower.
jbo: lo prenu poi lo ke'a speni cu morsi ku'o mrospe

source: I met her by chance at a restaurant yesterday.
jbo: mi cunso penmi ra bu'u lo gusta ca lo prulamdei

source: There was a light rain yesterday.
jbo: milxe carvi ca lo prulamdei

source: It rained all day long yesterday, so I stayed home.
jbo: carvi ca'o lo purlamdei .isemu'ibo mi zdazva

source: It was cold yesterday.
jbo: lenku ca lo prulamdei

source: He arrived in Tokyo yesterday.
jbo: ra klamu'o la.tokion. ca lo prulamdei

source: The same man that came yesterday is here again.
jbo: lo nanmu poi klama ti ca lo prulamdei cavi krefu zvati

source: My car was stolen last night.
jbo: lo mi karce pu selzerle'a ca lo prulamcte

source: I had my watch stolen last night.
jbo: zerle'a lo kanjunla mi ca lo prulamcte

source: Cherry blossoms are very beautiful.
jbo: lo tsakura cu mutce melbi

source: Someone stole my wallet.
jbo: zerle'a le mi dinvau

source: Bring me the magazines.
jbo: ko bevri lo karni mi

source: Mountains are not necessarily green.
jbo: ro cmana na crino

source: The rope broke when we were climbing the mountain.
jbo: lo skori cu porpi ca lo nu mi'a cpare lo cmana

source: I fear so.
jbo: mi terpa la'e di'u

source: Pay more attention to your work.
jbo: ko zmadu jundi lo do se gunka

source: I don't feel like working; what about going to a cinema instead?
jbo: .i mi na djica lo nu gunka .i .e'u mi'o ve skina

source: My sister is always weighing herself.
jbo: le mi mensi cu di'i merli lo vo'a junta

source: My sister was a beautiful woman.
jbo: le mensi be mi zo'u melbi ninmu

source: A child needs love.
jbo: lo verba ku nitcu lo nu se prami

source: My mother died when I was a kid.
jbo: le mamta cu mrobi'o ca lo mu'e mi pu verba

source: I love her to death.
jbo: mi prami ko'a pu lo nu mi mrobi'o

source: I do a lot of worrying.
jbo: mi xanka so'i roi

source: Must I open the window?
jbo: xu .ei mi kargau lo canko

source: It is her that I want to meet.
jbo: mi nu penmi rakau kei djica

source: Were you going to the railway station when I saw you?
jbo: xu do ca'o klama le renytcana ca lo nu mi penmi do

source: Unless I am mistaken, I've seen that man before.
jbo: fau lo nu mi na srera kei mi ba'o viska le ninmu ca da

source: I will get the machine running.
jbo: gau mi le minji ba akti

source: What has become of the book I put here yesterday?
jbo: mo lo cukta poi mi vi punji ca lo prulamdei

source: What I bought yesterday was these shoes.
jbo: da poi mi te vecnu ca lo prulamdei zo'u da vi cutci

source: They don't know that I'm Japanese.
jbo: ra na djuno lo du'u mi ponjo

source: I am to take over my father's business.
jbo: mi ba te dunda lo ka jitro le kagni po le mi patfu

source: Wait here until I come back.
jbo: ko vi denpa lo nu mi klama ti

source: Be quiet while I am speaking.
jbo: ko smaji ca lo nu mi tavla

source: Welcome to our home.
jbo: fi'i zdani mi'a

source: Our school is in the center of the town.
jbo: le mi ckule cu midju le tcadu

source: We must go there whether we like it or not.
jbo: nitcu lo nu mi'o klama .iju mi'o nelci ra

source: We have lived in Tokyo for six years.
jbo: mi'a ca'o xabju la.tokion. ze'a lo nanca be li xa

source: We love each other.
jbo: mi prami do soi vo'a

source: We had a heart-to-heart talk with each other.
jbo: mi'a stace tavysi'u

source: We painted the house green.
jbo: mi'a pu cintypu'i lo zdani lo crino

source: We saw a funny program on TV.
jbo: mi'a pu viska lo xajmi seltivni

source: We slept in a tent.
jbo: mi'a sipna ne'i lo bukmra

source: We were all present at the party.
jbo: .i ro lu'a mi'a zvati lo nunsla

source: We will reach Tokyo before dark.
jbo: mi tolyli'a la .tokios. pu lo nicte

source: We must study English.
jbo: ma'a bilga lo nu tadni lo glibau

source: We live close to the station.
jbo: mi'a xabju vi le renytcana

source: We sailed from Yokohama to Kobe.
jbo: mi'a la .kobes. la .iokoxamas. blokla

source: We enjoyed listening to the music.
jbo: lo nu tirna lo zgike kei mi'a pluka

source: We stopped talking so that we could hear the music.
jbo: mi'a tavla sisti mu'i lo nu tirna lo zgike

source: We need something to eat.
jbo: mi'o nitcu lo se citka

source: We lack nothing.
jbo: mi'o noda claxu

source: We will become happy in the long run.
jbo: ma'a za gleki binxo

source: We walked about five miles.
jbo: lo nu mi'a pu cadzu cu minli li ji'i mu

source: We are leaving for Hawaii tonight.
jbo: mi'a klama la xavais. ca lo cabvanci

source: We are getting off at the next station.
jbo: ro mi cliva fi lo bavla'i tcana

source: We hear with our ears.
jbo: ma'a tirna se pi'o loi vo'a kerlo

source: We introduced ourselves to each other.
jbo: mi'a simpengau ri

source: We lost our way in the woods.
jbo: mi'a pu cirko lo farna bu'u lo tricu foldi

source: We should preserve the beauties of the countryside.
jbo: ei mi jaigau ralte lo nurma ka melbi

source: We have a cat and a dog.
jbo: ma'a ralte lo mlatu e lo gerku

source: We have a cat. We are all fond of the cat.
jbo: mi'ai ralte le mlatu i ro da poi selcmi be mi'ai cu nelci my.

source: We saw her enter the room.
jbo: mi'ai pu viska lo nu ko'a co'i klama lo nenri be lo kumfa

source: We take a bath every day.
jbo: mi'a jirsezlu'i ca ro djedi

source: We must provide for our old age.
jbo: .ei ma'a kurji loi me ma'a laldo

source: Love me, love my dog.
jbo: lonu prami mi se sarcu lonu prami le mi gerku

source: Don't ask me for money.
jbo: ko na cpedu tu'a lo jdini mi

source: Please show me how to make cakes.
jbo: e'o ctuca mi lo nu jukpa lo titnanba

source: It's all Greek to me.
jbo: ro ti itkuile ga'a mi

source: I saw a little boy called Tony Evans.
jbo: mi pu viska lo cmalu nanla poi se cmene la .tonis. evans.

source: I am free of debt.
jbo: mi dejni no da

source: My uncle keeps a dog.
jbo: lo mi famti cu ralte lo gerku

source: My father is very nice.
jbo: le patfu be mi cu tcexau

source: Do you remember me?
jbo: xu do morji fi mi

source: My boyfriend seems serious.
jbo: lo mi nakpa'i cu simlu lo ka junri
